pkg/wsman/wsmantesting/responses/amt/boot/settingdata/put.xml

<?xml version="1.0" encoding="utf-8"?>
<Envelope
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
	xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
	xmlns="http://www.w3.org/2003/05/soap-envelope">
	<Header>
		<a:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/Put</a:Action>
		<a:To>/wsman</a:To>
		<w:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_BootSettingData</w:ResourceURI>
		<a:MessageID>1</a:MessageID>
		<a:ReplyTo>
			<a:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
		</a:ReplyTo>
		<w:OperationTimeout>PT60S</w:OperationTimeout>
	</Header>
	<Body>
		<h:AMT_BootSettingData
			xmlns:h="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_BootSettingData">
			<h:BIOSLastStatus>2</h:BIOSLastStatus>
			<h:BIOSLastStatus>0</h:BIOSLastStatus>
			<h:BIOSPause>false</h:BIOSPause>
			<h:BIOSSetup>false</h:BIOSSetup>
			<h:BootMediaIndex>0</h:BootMediaIndex>
			<h:BootguardStatus>127</h:BootguardStatus>
			<h:ConfigurationDataReset>false</h:ConfigurationDataReset>
			<h:ElementName>Intel(r) AMT Boot Configuration Settings</h:ElementName>
			<h:EnforceSecureBoot>false</h:EnforceSecureBoot>
			<h:FirmwareVerbosity>0</h:FirmwareVerbosity>
			<h:ForcedProgressEvents>false</h:ForcedProgressEvents>
			<h:IDERBootDevice>0</h:IDERBootDevice>
			<h:InstanceID>Intel(r) AMT:BootSettingData 0</h:InstanceID>
			<h:LockKeyboard>false</h:LockKeyboard>
			<h:LockPowerButton>false</h:LockPowerButton>
			<h:LockResetButton>false</h:LockResetButton>
			<h:LockSleepButton>false</h:LockSleepButton>
			<h:OptionsCleared>true</h:OptionsCleared>
			<h:OwningEntity>Intel(r) AMT</h:OwningEntity>
			<h:PlatformErase>false</h:PlatformErase>
			<h:RPEEnabled>false</h:RPEEnabled>
			<h:RSEPassword></h:RSEPassword>
			<h:ReflashBIOS>false</h:ReflashBIOS>
			<h:SecureBootControlEnabled>false</h:SecureBootControlEnabled>
			<h:SecureErase>false</h:SecureErase>
			<h:UEFIHTTPSBootEnabled>false</h:UEFIHTTPSBootEnabled>
			<h:UEFILocalPBABootEnabled>false</h:UEFILocalPBABootEnabled>
			<h:UefiBootNumberOfParams>0</h:UefiBootNumberOfParams>
			<h:UseIDER>false</h:UseIDER>
			<h:UseSOL>false</h:UseSOL>
			<h:UseSafeMode>false</h:UseSafeMode>
			<h:UserPasswordBypass>false</h:UserPasswordBypass>
			<h:WinREBootEnabled>false</h:WinREBootEnabled>
		</h:AMT_BootSettingData>
	</Body>
</Envelope>